#Область ОбработчикиСобытийФормы

	&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	  ПараметрыГиперссылки = РаботаСФайлами.ГиперссылкаФайлов();  
	  ПараметрыГиперссылки.Размещение = "ГруппаКартинка";    
	  ПараметрыГиперссылки.Видимость = Истина;
	  
	  ПараметрыПоля = РаботаСФайлами.ПолеФайла();         
	  ПараметрыПоля.ПутьКДанным = "Объект.Логотип";      
	  ПараметрыПоля.ПутьКДаннымИзображения = "АдресКартинки";    
	  ПараметрыПоля.Размещение = "ГруппаКартинка";   
	  ПараметрыПоля.ПоказыватьКоманднуюПанель = Ложь;
	  
	  ДобавляемыеЭлементы = Новый Массив;
	  ДобавляемыеЭлементы.Добавить(ПараметрыГиперссылки);
	  ДобавляемыеЭлементы.Добавить(ПараметрыПоля);
	  РаботаСФайлами.ПриСозданииНаСервере(ЭтотОбъект, ДобавляемыеЭлементы);
	
  КонецПроцедуры 
  
  &НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	РаботаСФайламиКлиент.ПриОткрытии(ЭтотОбъект, Отказ);	  
	
КонецПроцедуры   

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	РаботаСФайламиКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СайтНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
    Если НЕ ПустаяСтрока(Объект.Сайт) Тогда
	
		Попытка
			ЗапуститьПриложение(Объект.Сайт);		
		Исключение  
			Текст = "Не удалось открыть сайт по причине: " + ОписаниеОшибки(); 
		    ОбщегоНазначенияКлиент.СообщитьПользователю(Текст);
		КонецПопытки;
	
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраНажатие(Элемент, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраНажатие(ЭтотОбъект, Элемент, СтандартнаяОбработка);

КонецПроцедуры // ()

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПеретаскивание(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);

КонецПроцедуры // ()

&НаКлиенте
Процедура Подключаемый_ПолеПредпросмотраПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)

	РаботаСФайламиКлиент.ПолеПредпросмотраПроверкаПеретаскивания(ЭтотОбъект, Элемент,
				ПараметрыПеретаскивания, СтандартнаяОбработка);

КонецПроцедуры // () 
			
#КонецОбласти

#Область ОбработчикиКомандФорм

&НаКлиенте
Процедура Подключаемый_КомандаПанелиПрисоединенныхФайлов(Команда)
	
	РаботаСФайламиКлиент.КомандаУправленияПрисоединеннымиФайлами(ЭтотОбъект, Команда);
	
КонецПроцедуры // ()

#КонецОбласти

			
  
  
  
  
  
