
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Цена = 0 Тогда
	    Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Укажите цену";
		Сообщение.Поле = "Цена";
		Сообщение.Сообщить();
		
	    Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ТекДата = НачалоДня(ТекущаяДата()); 
	НаборЗаписей = РегистрыСведений.Цены.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Период.Установить(ТекДата);     
	НаборЗаписей.Отбор.Услуга.Установить(ТекущийОбъект.Ссылка); 
	НаборЗаписей.Прочитать();
	
	ЕстьИзменения = Ложь;
	Если НаборЗаписей.Количество() = 0 Тогда
	    Запись = НаборЗаписей.Добавить();
		Запись.Период = ТекДата;
		Запись.Услуга = ТекущийОбъект.Ссылка;
		Запись.Цена = Цена; 
		
		ЕстьИзменения = Истина;
	Иначе  
		
		Запись = НаборЗаписей[0];
		Если Запись.Цена <> Цена Тогда
		    Запись.Цена = Цена;
			ЕстьИзменения = Истина;		
		КонецЕсли;
	
	КонецЕсли;

	НаборЗаписей.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЦеныСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(, Услуга = &Услуга) КАК ЦеныСрезПоследних";
	
	Запрос.УстановитьПараметр("Услуга", ТекущийОбъект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
	
		Выборка = РезультатЗапроса.Выбрать();	
	    Выборка.Следующий(); 
		Цена = Выборка.Цена;
	КонецЕсли;
	
КонецПроцедуры
