#Область Настройки

Функция ПолучитьНастройкиПодключенияИзРегистра() Экспорт  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КАБНастройкиПодключенияКRabbitMQ.Адрес КАК Адрес,
		|	КАБНастройкиПодключенияКRabbitMQ.Порт КАК Порт,
		|	КАБНастройкиПодключенияКRabbitMQ.Логин КАК Логин,
		|	КАБНастройкиПодключенияКRabbitMQ.Пароль КАК Пароль,
		|	КАБНастройкиПодключенияКRabbitMQ.ВиртуальныйХост КАК ВиртуальныйХост,
		|	КАБНастройкиПодключенияКRabbitMQ.ТочкаОбмена КАК ТочкаОбмена,
		|	КАБНастройкиПодключенияКRabbitMQ.ИмяОчереди КАК ИмяОчереди,
		|	КАБНастройкиПодключенияКRabbitMQ.Включен КАК Включен,
		|	КАБНастройкиПодключенияКRabbitMQ.Таймаут КАК Таймаут,
		|	КАБНастройкиПодключенияКRabbitMQ.КлючМаршрута КАК КлючМаршрута
		|ИЗ
		|	РегистрСведений.КАБНастройкиПодключенияКRabbitMQ КАК КАБНастройкиПодключенияКRabbitMQ
		|ГДЕ
		|	КАБНастройкиПодключенияКRabbitMQ.Включен";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	

	
	Настройки = Новый Структура("Адрес,Порт,Логин,Пароль,ВиртуальныйХост,ТочкаОбмена,ИмяОчереди,Таймаут,КлючМаршрута");
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(Настройки, ВыборкаДетальныеЗаписи);
	КонецЕсли;
	
	Возврат Настройки;
	
КонецФункции

Функция ПолучитьНастройкиПодключения(Адрес, Порт, Логин, Пароль, ВиртуальныйХост,ТочкаОбмена, ИмяОчереди, Таймаут) Экспорт  
	
	Возврат Новый Структура("Адрес,Порт,Логин,Пароль,ВиртуальныйХост,ТочкаОбмена,ИмяОчереди,Таймаут",
			Адрес, Порт, Логин, Пароль, ВиртуальныйХост, ТочкаОбмена, ИмяОчереди, Таймаут);
КонецФункции

#КонецОбласти

#Область Компонента 

Функция ПолучитьКомпоненту() Экспорт 

	КлиентКомпоненты = Неопределено;
	Если Не ИнициализироватьКомпоненту(КлиентКомпоненты) Тогда
		
		РезультатПодключения = ПодключитьВнешнююКомпоненту("ОбщийМакет.PinkRabbitMQ", "BITERP", ТипВнешнейКомпоненты.Native);
		
		Если РезультатПодключения Тогда
			ИнициализироватьКомпоненту(КлиентКомпоненты);
		КонецЕсли;    	
	КонецЕсли;
	
	Возврат КлиентКомпоненты;
	
КонецФункции

Функция ИнициализироватьКомпоненту(Компонента)
	
	Попытка
		Компонента  = Новый("AddIn.BITERP.PinkRabbitMQ");
		Возврат Истина;
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти  



