
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Продажа") Тогда
		// Заполнение шапки
		Запись = ДанныеЗаполнения.Запись;
		Клиент = ДанныеЗаполнения.Клиент;
		Салон = ДанныеЗаполнения.Салон;
		Сумма = ДанныеЗаполнения.Сумма; 
		Продажа = ДанныеЗаполнения;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр Деньги Приход
	Движения.Деньги.Записывать = Истина;
	Движение = Движения.Деньги.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;     
	Движение.Салон = Салон;
	Движение.ТипДенежныхСредств = ТипДенежныхСредствПоСпособуОплаты(СпособОплаты);
	Движение.Сумма = Сумма; 
	
	Движения.ДвижениеДенежныхСредств.Записывать = Истина;
	Движение = Движения.ДвижениеДенежныхСредств.Добавить();
	Движение.Период = Дата;
	Движение.Салон = Салон;
	Движение.ТипДенежныхСредств = ТипДенежныхСредствПоСпособуОплаты(СпособОплаты);
	Движение.Статья = Статья;
	Движение.СуммаПриход = Сумма

КонецПроцедуры

Функция ТипДенежныхСредствПоСпособуОплаты(СпособОплаты)

	Соответствие = Новый Соответствие;
	Соответствие.Вставить(Перечисления.СпособыОплаты.Наличные, Перечисления.ТипыДенежныхСредств.Наличные);
	Соответствие.Вставить(Перечисления.СпособыОплаты.Карта, Перечисления.ТипыДенежныхСредств.Безналичные);
	
	Возврат Соответствие[СпособОплаты];
	
КонецФункции // ()
