
&НаСервере
Процедура ОтправитьНаСервере()

	ТекЗапись = РегистрыСведений.ОтправкаВRabbitMQ.СоздатьМенеджерЗаписи();
	ТекЗапись.Салон = Объект.Салон; 
	ТекЗапись.Сотрудник = Объект.Сотрудник;
	ТекЗапись.Услуга = Объект.Услуга;
	ТекЗапись.Клиент = Объект.Клиент;
	ТекЗапись.Комментарий = Объект.Комментарий;
	ТекЗапись.Дата = Объект.Дата;
	ТекЗапись.ТелефонКлиента = Объект.ТелефонКлиента;
	ТекЗапись.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура Отправить(Команда)
	ОтправитьНаСервере();
	
	Сообщение = Новый СообщениеПользователю;
	Сообщение.Текст = "Запись сформирована";
	Сообщение.Сообщить();
КонецПроцедуры
