#Область ОбработчикиСобытийФормы

	&НаСервере
	Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		
		ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
		
	КонецПроцедуры   
	
	&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		//Вставить содержимое обработчика
	КонецПроцедуры
	
#КонецОбласти

#Область ОбработчикиКомандФормы

	&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Элементы.Список);
	
КонецПроцедуры // ()

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);	

КонецПроцедуры // ()

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)

	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Элементы.Список);	

КонецПроцедуры // () 

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);	

КонецПроцедуры // ()


 #Область ОбработчикиСобытийТаблицыФормыСписок
 
 &НаКлиенте
 Процедура СписокПриАктивизацииСтроки(Элемент)
	 
	 ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	 
 КонецПроцедуры
 
#КонецОбласти

 #КонецОбласти  